; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	satellite5 - satellite
	instrument8 - instrument
	spectrograph1 - mode
	image0 - mode
	Star0 - direction
	Star6 - direction
	Star2 - direction
	GroundStation1 - direction
	Star4 - direction
	GroundStation3 - direction
	GroundStation5 - direction
	Phenomenon7 - direction
	Star8 - direction
	Planet9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Planet12 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 image0)
	(calibration_target instrument2 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star4)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation5)
	(supports instrument4 spectrograph1)
	(supports instrument4 image0)
	(calibration_target instrument4 GroundStation5)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star6)
	(supports instrument5 image0)
	(calibration_target instrument5 GroundStation1)
	(calibration_target instrument5 Star2)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 GroundStation5)
	(calibration_target instrument6 GroundStation1)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon11)
	(supports instrument7 spectrograph1)
	(supports instrument7 image0)
	(calibration_target instrument7 Star4)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation5)
	(supports instrument8 spectrograph1)
	(supports instrument8 image0)
	(calibration_target instrument8 GroundStation5)
	(calibration_target instrument8 GroundStation3)
	(on_board instrument8 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star2)
)
(:goal (and
	(pointing satellite1 Phenomenon7)
	(have_image Phenomenon7 spectrograph1)
	(have_image Star8 image0)
	(have_image Planet9 image0)
	(have_image Star10 spectrograph1)
	(have_image Phenomenon11 image0)
	(have_image Planet12 image0)
))

)

; plan
1. (turn_to satellite2 groundstation5 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 groundstation5)
   goals met: 0 of 7
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 7
3. (calibrate satellite2 instrument4 groundstation5)
   added: (calibrated instrument4)
   goals met: 0 of 7
4. (turn_to satellite2 planet9 groundstation5)
   deleted: (pointing satellite2 groundstation5)
   added: (pointing satellite2 planet9)
   goals met: 0 of 7
5. (take_image satellite2 planet9 instrument4 image0)
   added: (have_image planet9 image0)
   goals met: 1 of 7
6. (turn_to satellite2 planet12 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 planet12)
   goals met: 1 of 7
7. (take_image satellite2 planet12 instrument4 image0)
   added: (have_image planet12 image0)
   goals met: 2 of 7
8. (turn_to satellite2 phenomenon7 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 phenomenon7)
   goals met: 2 of 7
9. (take_image satellite2 phenomenon7 instrument4 spectrograph1)
   added: (have_image phenomenon7 spectrograph1)
   goals met: 3 of 7
10. (turn_to satellite2 phenomenon11 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 phenomenon11)
   goals met: 3 of 7
11. (take_image satellite2 phenomenon11 instrument4 image0)
   added: (have_image phenomenon11 image0)
   goals met: 4 of 7
12. (turn_to satellite1 phenomenon7 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 phenomenon7)
   goals met: 5 of 7
13. (turn_to satellite2 star10 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 star10)
   goals met: 5 of 7
14. (take_image satellite2 star10 instrument4 spectrograph1)
   added: (have_image star10 spectrograph1)
   goals met: 6 of 7
15. (turn_to satellite2 star8 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star8)
   goals met: 6 of 7
16. (take_image satellite2 star8 instrument4 image0)
   added: (have_image star8 image0)
   goals met: 7 of 7
